BUILD/doc/source/_static/soap_outputs/6.5.314.4301/ask_manual_question_sensor_with_parameters_and_filter_step_4_request.xml

<?xml version="1.0" encoding="utf-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <SOAP-ENV:Body>
    <typens:tanium_soap_request xmlns:typens="urn:TaniumSOAP">
      <command>AddObject</command>
      <object_list>
        <question>
          <group>
            <filters></filters>
          </group>
          <selects>
            <select>
              <filter>
                <not_flag>0</not_flag>
                <value>.*Shared.*</value>
                <operator>RegexMatch</operator>
                <sensor>
                  <hash>3881863289</hash>
                  <id>510</id>
                </sensor>
              </filter>
              <sensor>
                <source_id>510</source_id>
                <parameters>
                  <parameter>
                    <value>C:\Program Files</value>
                    <key>||folderPath||</key>
                  </parameter>
                </parameters>
              </sensor>
            </select>
          </selects>
        </question>
      </object_list>
      <options>
        <suppress_object_list>1</suppress_object_list>
      </options>
    </typens:tanium_soap_request>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>